Revit 2027 API
MEPSpaceConstruction.CurrentConstruction Property
Get all the Building Constructions according to the specific Construction type.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public MEPBuildingConstruction CurrentConstruction { get; set; }
Public Property CurrentConstruction As MEPBuildingConstruction
	Get
	Set
public:
property MEPBuildingConstruction^ CurrentConstruction {
	MEPBuildingConstruction^ get ();
	void set (MEPBuildingConstruction^ value);
}
member CurrentConstruction : MEPBuildingConstruction with get, set
Property Value
MEPBuildingConstruction
Remarks
This property is used to get or set the Building Service of the Project Information.
See Also
Reference
MEPSpaceConstruction Class
Autodesk.Revit.DB.Mechanical Namespace